collected-data/gfs-4-rep-results/experiements-1-3/1-failure/tf/fio-gfs-test-low-rand-write-tf.txt
Started: 04-04-2022--18-25-48

low-rand-write-/mnt/gfs: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-rand-write-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-rand-write-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=23703: Mon Apr  4 18:27:16 2022
  write: IOPS=28, BW=3644KiB/s (3731kB/s)(85.8MiB/24098msec); 0 zone resets
    slat (nsec): min=32057, max=56851, avg=37987.36, stdev=2709.88
    clat (usec): min=34715, max=44205, avg=35078.71, stdev=418.34
     lat (usec): min=34753, max=44246, avg=35118.46, stdev=418.47
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[34866],
     | 30.00th=[34866], 40.00th=[34866], 50.00th=[34866], 60.00th=[34866],
     | 70.00th=[34866], 80.00th=[35390], 90.00th=[35390], 95.00th=[35390],
     | 99.00th=[35390], 99.50th=[35914], 99.90th=[44303], 99.95th=[44303],
     | 99.99th=[44303]
   bw (  KiB/s): min= 3584, max= 3847, per=99.98%, avg=3643.25, stdev=108.78, samples=48
   iops        : min=   28, max=   30, avg=28.46, stdev= 0.85, samples=48
  lat (msec)   : 50=100.00%
  cpu          : usr=0.06%, sys=0.06%, ctx=1373, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,686,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3644KiB/s (3731kB/s), 3644KiB/s-3644KiB/s (3731kB/s-3731kB/s), io=85.8MiB (89.9MB), run=24098-24098msec
low-rand-write-/mnt/gfs: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-rand-write-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-rand-write-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=24238: Mon Apr  4 18:28:45 2022
  write: IOPS=28, BW=3647KiB/s (3735kB/s)(85.8MiB/24075msec); 0 zone resets
    slat (usec): min=31, max=131, avg=38.06, stdev= 4.64
    clat (usec): min=34676, max=39307, avg=35044.12, stdev=206.61
     lat (usec): min=34716, max=39348, avg=35083.93, stdev=207.03
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[34866],
     | 30.00th=[34866], 40.00th=[34866], 50.00th=[34866], 60.00th=[34866],
     | 70.00th=[34866], 80.00th=[34866], 90.00th=[35390], 95.00th=[35390],
     | 99.00th=[35390], 99.50th=[35390], 99.90th=[39060], 99.95th=[39060],
     | 99.99th=[39060]
   bw (  KiB/s): min= 3584, max= 3847, per=99.88%, avg=3643.25, stdev=108.78, samples=48
   iops        : min=   28, max=   30, avg=28.46, stdev= 0.85, samples=48
  lat (msec)   : 50=100.00%
  cpu          : usr=0.06%, sys=0.05%, ctx=1373, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,686,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3647KiB/s (3735kB/s), 3647KiB/s-3647KiB/s (3735kB/s-3735kB/s), io=85.8MiB (89.9MB), run=24075-24075msec
low-rand-write-/mnt/gfs: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-rand-write-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-rand-write-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=24774: Mon Apr  4 18:30:13 2022
  write: IOPS=28, BW=3644KiB/s (3732kB/s)(85.8MiB/24095msec); 0 zone resets
    slat (nsec): min=31359, max=60971, avg=37763.09, stdev=2931.15
    clat (usec): min=34692, max=49914, avg=35074.49, stdev=612.84
     lat (usec): min=34735, max=49956, avg=35114.03, stdev=612.95
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[34866],
     | 30.00th=[34866], 40.00th=[34866], 50.00th=[34866], 60.00th=[34866],
     | 70.00th=[34866], 80.00th=[35390], 90.00th=[35390], 95.00th=[35390],
     | 99.00th=[35390], 99.50th=[35914], 99.90th=[50070], 99.95th=[50070],
     | 99.99th=[50070]
   bw (  KiB/s): min= 3334, max= 3840, per=99.97%, avg=3643.23, stdev=120.34, samples=48
   iops        : min=   26, max=   30, avg=28.46, stdev= 0.94, samples=48
  lat (msec)   : 50=100.00%
  cpu          : usr=0.05%, sys=0.07%, ctx=1375, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,686,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3644KiB/s (3732kB/s), 3644KiB/s-3644KiB/s (3732kB/s-3732kB/s), io=85.8MiB (89.9MB), run=24095-24095msec