collected-data/gfs-4-rep-results/experiements-1-3/1-failure/tf/fio-gfs-test-low-seq-write-tf.txt
Started: 04-04-2022--18-43-44

low-seq-write-/mnt/gfs: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-write-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-write-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=30207: Mon Apr  4 18:45:12 2022
  write: IOPS=28, BW=3645KiB/s (3733kB/s)(85.8MiB/24087msec); 0 zone resets
    slat (usec): min=32, max=2108, avg=41.73, stdev=79.32
    clat (usec): min=34694, max=43097, avg=35059.42, stdev=362.47
     lat (usec): min=34734, max=43140, avg=35102.93, stdev=372.04
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[34866],
     | 30.00th=[34866], 40.00th=[34866], 50.00th=[34866], 60.00th=[34866],
     | 70.00th=[34866], 80.00th=[35390], 90.00th=[35390], 95.00th=[35390],
     | 99.00th=[35390], 99.50th=[35390], 99.90th=[43254], 99.95th=[43254],
     | 99.99th=[43254]
   bw (  KiB/s): min= 3584, max= 3840, per=99.93%, avg=3643.10, stdev=108.51, samples=48
   iops        : min=   28, max=   30, avg=28.46, stdev= 0.85, samples=48
  lat (msec)   : 50=100.00%
  cpu          : usr=0.07%, sys=0.05%, ctx=1375, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,686,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3645KiB/s (3733kB/s), 3645KiB/s-3645KiB/s (3733kB/s-3733kB/s), io=85.8MiB (89.9MB), run=24087-24087msec
low-seq-write-/mnt/gfs: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-write-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-write-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=30743: Mon Apr  4 18:46:40 2022
  write: IOPS=28, BW=3649KiB/s (3736kB/s)(85.8MiB/24066msec); 0 zone resets
    slat (usec): min=30, max=867, avg=39.05, stdev=31.80
    clat (usec): min=34669, max=43148, avg=35030.56, stdev=333.09
     lat (usec): min=34706, max=43190, avg=35071.36, stdev=334.65
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[34866],
     | 30.00th=[34866], 40.00th=[34866], 50.00th=[34866], 60.00th=[34866],
     | 70.00th=[34866], 80.00th=[34866], 90.00th=[35390], 95.00th=[35390],
     | 99.00th=[35390], 99.50th=[35390], 99.90th=[43254], 99.95th=[43254],
     | 99.99th=[43254]
   bw (  KiB/s): min= 3584, max= 3847, per=99.98%, avg=3648.58, stdev=112.38, samples=48
   iops        : min=   28, max=   30, avg=28.50, stdev= 0.88, samples=48
  lat (msec)   : 50=100.00%
  cpu          : usr=0.01%, sys=0.10%, ctx=1373, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,686,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3649KiB/s (3736kB/s), 3649KiB/s-3649KiB/s (3736kB/s-3736kB/s), io=85.8MiB (89.9MB), run=24066-24066msec
low-seq-write-/mnt/gfs: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-write-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-write-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=31291: Mon Apr  4 18:48:09 2022
  write: IOPS=28, BW=3650KiB/s (3738kB/s)(85.8MiB/24057msec); 0 zone resets
    slat (nsec): min=30660, max=54826, avg=37928.45, stdev=2794.81
    clat (usec): min=34690, max=35586, avg=35018.28, stdev=112.57
     lat (usec): min=34732, max=35624, avg=35057.96, stdev=112.55
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[34866],
     | 30.00th=[34866], 40.00th=[34866], 50.00th=[34866], 60.00th=[34866],
     | 70.00th=[34866], 80.00th=[34866], 90.00th=[35390], 95.00th=[35390],
     | 99.00th=[35390], 99.50th=[35390], 99.90th=[35390], 99.95th=[35390],
     | 99.99th=[35390]
   bw (  KiB/s): min= 3584, max= 3840, per=99.95%, avg=3648.58, stdev=111.70, samples=48
   iops        : min=   28, max=   30, avg=28.50, stdev= 0.88, samples=48
  lat (msec)   : 50=100.00%
  cpu          : usr=0.03%, sys=0.08%, ctx=1373, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,686,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3650KiB/s (3738kB/s), 3650KiB/s-3650KiB/s (3738kB/s-3738kB/s), io=85.8MiB (89.9MB), run=24057-24057msec